
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.0   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do createallgraphs30.do 

. capture log close

. set logtype text

. 
. log using "now we're creating all the beautiful graphs", replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Tresorit/projects/published/voldev/replication/now we
> 're creating all the beautiful graphs.log
  log type:  text
 opened on:  12 Oct 2020, 08:42:53

. 
. use minimumvariance, clear

. 
. 
. tsset, clear

. 
. 
. drop if rgdpch==0
(0 observations deleted)

. *USA = 840
. 
. 
. 
. 
. gen loggdp = log(rgdpch)
(3,993 missing values generated)

. 
. rename COV Sector_Country_Covariance

. rename SECT Sectoral_Risk

. rename HERF Herfindahl

. rename dnHERF Weighted_Herf

. rename TAU2 Country_Risk

. rename dnRISK Overall_risk

. rename BETA Sector_Country_Beta

. *rename Fs2 Textiles
. *rename Fs16 Electric_Machinery
. rename DIST1 Dist_to_Own_Frontier

. rename DIST2 Dist_to_World_Frontier

. 
. label var loggdp "Log Real GDP per capita (PPP)"

. 
. 
. 
. label var Herfindahl "Herfindahl Index"

. label var Weighted_Herf "Weighted Herfindahl"

. label var Sectoral_Risk "Sectoral Risk"

. label var Country_Risk "Country Risk"

. label var Overall_risk "Overall Risk"

. label var Sector_Country_Beta "Sector-Country Beta"

. label var Sector_Country_Covariance "Sector-Country Covariance"

. *label var Textiles "Textiles"
. *label var Electric_Machinery "Electric Machinery"
. label var Dist_to_Own_Frontier "Distance to Own Frontier"

. label var Dist_to_World_Frontier "Distance of Own to World Frontier"

. 
. 
. 
. 
. 
. 
. foreach X of varlist  Herfindahl Weighted_Herf Sectoral_Risk Sector_Country_B
> eta Dist_to_Own_Frontier Dist_to_World_Frontier {
  2.         do drawgraphs `X' loggdp
  3. }

. 
. set more off

. 
. capture drop u

. capture drop fitted

. capture drop `1'within

. 
. lowess `1' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manua
> l) plotregion(ilwidth(medthin))

. 
. 
. graph export "lowess_`1'_`2'.ps", as(ps) replace
(file lowess_Herfindahl_loggdp.ps written in PostScript format)

. 
. 
. 
. xtreg `1' `2', i(country) fe

Fixed-effects (within) regression               Number of obs     =      1,427
Group variable: country                         Number of groups  =         45

R-sq:                                           Obs per group:
     within  = 0.0042                                         min =         20
     between = 0.4261                                         avg =       31.7
     overall = 0.3372                                         max =         37

                                                F(1,1381)         =       5.76
corr(u_i, Xb)  = 0.5714                         Prob > F          =     0.0165

------------------------------------------------------------------------------
  Herfindahl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      loggdp |  -.0003203   .0001334    -2.40   0.016     -.000582   -.0000586
       _cons |   .0107961   .0011798     9.15   0.000     .0084817    .0131106
-------------+----------------------------------------------------------------
     sigma_u |  .00340241
     sigma_e |  .00139177
         rho |  .85665866   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(44, 1381) = 116.21                  Prob > F = 0.0000

. predict u, u
(6,882 missing values generated)

. gen `1'within = `1'-u
(6,882 missing values generated)

. 
. lowess `1'within `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s
> 1manual) plotregion(ilwidth(medthin))

. 
. graph export "within_`1'_`2'.ps", as(ps) replace
(file within_Herfindahl_loggdp.ps written in PostScript format)

. 
. set more on

. 
end of do-file

. 
. set more off

. 
. capture drop u

. capture drop fitted

. capture drop `1'within

. 
. lowess `1' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manua
> l) plotregion(ilwidth(medthin))

. 
. 
. graph export "lowess_`1'_`2'.ps", as(ps) replace
(file lowess_Weighted_Herf_loggdp.ps written in PostScript format)

. 
. 
. 
. xtreg `1' `2', i(country) fe

Fixed-effects (within) regression               Number of obs     =      1,427
Group variable: country                         Number of groups  =         45

R-sq:                                           Obs per group:
     within  = 0.0029                                         min =         20
     between = 0.5805                                         avg =       31.7
     overall = 0.4811                                         max =         37

                                                F(1,1381)         =       3.98
corr(u_i, Xb)  = 0.6915                         Prob > F          =     0.0462

------------------------------------------------------------------------------
Weighted_H~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      loggdp |  -.0002796   .0001401    -2.00   0.046    -.0005544   -4.76e-06
       _cons |   .0080102   .0012389     6.47   0.000     .0055798    .0104405
-------------+----------------------------------------------------------------
     sigma_u |  .00636153
     sigma_e |  .00146147
         rho |  .94986749   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(44, 1381) = 285.54                  Prob > F = 0.0000

. predict u, u
(6,882 missing values generated)

. gen `1'within = `1'-u
(6,882 missing values generated)

. 
. lowess `1'within `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s
> 1manual) plotregion(ilwidth(medthin))

. 
. graph export "within_`1'_`2'.ps", as(ps) replace
(file within_Weighted_Herf_loggdp.ps written in PostScript format)

. 
. set more on

. 
end of do-file

. 
. set more off

. 
. capture drop u

. capture drop fitted

. capture drop `1'within

. 
. lowess `1' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manua
> l) plotregion(ilwidth(medthin))

. 
. 
. graph export "lowess_`1'_`2'.ps", as(ps) replace
(file lowess_Sectoral_Risk_loggdp.ps written in PostScript format)

. 
. 
. 
. xtreg `1' `2', i(country) fe

Fixed-effects (within) regression               Number of obs     =      1,427
Group variable: country                         Number of groups  =         45

R-sq:                                           Obs per group:
     within  = 0.4593                                         min =         20
     between = 0.5989                                         avg =       31.7
     overall = 0.5635                                         max =         37

                                                F(1,1381)         =    1172.96
corr(u_i, Xb)  = -0.1916                        Prob > F          =     0.0000

------------------------------------------------------------------------------
Sectoral_R~k |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      loggdp |  -.0004908   .0000143   -34.25   0.000    -.0005189   -.0004627
       _cons |   .0080578   .0001267    63.58   0.000     .0078092    .0083064
-------------+----------------------------------------------------------------
     sigma_u |  .00030817
     sigma_e |  .00014951
         rho |  .80948083   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(44, 1381) = 127.79                  Prob > F = 0.0000

. predict u, u
(6,882 missing values generated)

. gen `1'within = `1'-u
(6,882 missing values generated)

. 
. lowess `1'within `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s
> 1manual) plotregion(ilwidth(medthin))

. 
. graph export "within_`1'_`2'.ps", as(ps) replace
(file within_Sectoral_Risk_loggdp.ps written in PostScript format)

. 
. set more on

. 
end of do-file

. 
. set more off

. 
. capture drop u

. capture drop fitted

. capture drop `1'within

. 
. lowess `1' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manua
> l) plotregion(ilwidth(medthin))

. 
. 
. graph export "lowess_`1'_`2'.ps", as(ps) replace
(file lowess_Sector_Country_Beta_loggdp.ps written in PostScript format)

. 
. 
. 
. xtreg `1' `2', i(country) fe

Fixed-effects (within) regression               Number of obs     =      1,427
Group variable: country                         Number of groups  =         45

R-sq:                                           Obs per group:
     within  = 0.0364                                         min =         20
     between = 0.0077                                         avg =       31.7
     overall = 0.0028                                         max =         37

                                                F(1,1381)         =      52.21
corr(u_i, Xb)  = -0.0766                        Prob > F          =     0.0000

------------------------------------------------------------------------------
Sector_Cou~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      loggdp |   .0060261    .000834     7.23   0.000     .0043902    .0076621
       _cons |  -.1114811   .0073751   -15.12   0.000    -.1259487   -.0970134
-------------+----------------------------------------------------------------
     sigma_u |   .2199185
     sigma_e |  .00870004
         rho |  .99843743   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(44, 1381) = 21079.88                Prob > F = 0.0000

. predict u, u
(6,882 missing values generated)

. gen `1'within = `1'-u
(6,882 missing values generated)

. 
. lowess `1'within `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s
> 1manual) plotregion(ilwidth(medthin))

. 
. graph export "within_`1'_`2'.ps", as(ps) replace
(file within_Sector_Country_Beta_loggdp.ps written in PostScript format)

. 
. set more on

. 
end of do-file

. 
. set more off

. 
. capture drop u

. capture drop fitted

. capture drop `1'within

. 
. lowess `1' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manua
> l) plotregion(ilwidth(medthin))

. 
. 
. graph export "lowess_`1'_`2'.ps", as(ps) replace
(file lowess_Dist_to_Own_Frontier_loggdp.ps written in PostScript format)

. 
. 
. 
. xtreg `1' `2', i(country) fe

Fixed-effects (within) regression               Number of obs     =      1,427
Group variable: country                         Number of groups  =         45

R-sq:                                           Obs per group:
     within  = 0.0131                                         min =         20
     between = 0.0756                                         avg =       31.7
     overall = 0.0732                                         max =         37

                                                F(1,1381)         =      18.37
corr(u_i, Xb)  = 0.2292                         Prob > F          =     0.0000

------------------------------------------------------------------------------
Dist_to_Ow~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      loggdp |  -.0006169   .0001439    -4.29   0.000    -.0008992   -.0003346
       _cons |   .0134508   .0012727    10.57   0.000     .0109542    .0159474
-------------+----------------------------------------------------------------
     sigma_u |  .01382221
     sigma_e |   .0015013
         rho |  .98834037   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(44, 1381) = 1868.05                 Prob > F = 0.0000

. predict u, u
(6,882 missing values generated)

. gen `1'within = `1'-u
(6,882 missing values generated)

. 
. lowess `1'within `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s
> 1manual) plotregion(ilwidth(medthin))

. 
. graph export "within_`1'_`2'.ps", as(ps) replace
(file within_Dist_to_Own_Frontier_loggdp.ps written in PostScript format)

. 
. set more on

. 
end of do-file

. 
. set more off

. 
. capture drop u

. capture drop fitted

. capture drop `1'within

. 
. lowess `1' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manua
> l) plotregion(ilwidth(medthin))

. 
. 
. graph export "lowess_`1'_`2'.ps", as(ps) replace
(file lowess_Dist_to_World_Frontier_loggdp.ps written in PostScript format)

. 
. 
. 
. xtreg `1' `2', i(country) fe

Fixed-effects (within) regression               Number of obs     =      1,427
Group variable: country                         Number of groups  =         45

R-sq:                                           Obs per group:
     within  = 0.0009                                         min =         20
     between = 0.1215                                         avg =       31.7
     overall = 0.0926                                         max =         37

                                                F(1,1381)         =       1.21
corr(u_i, Xb)  = -0.3076                        Prob > F          =     0.2722

------------------------------------------------------------------------------
Dist_to_Wo~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      loggdp |   .0001788   .0001628     1.10   0.272    -.0001405    .0004981
       _cons |   .0216418   .0014395    15.03   0.000      .018818    .0244656
-------------+----------------------------------------------------------------
     sigma_u |  .05457063
     sigma_e |  .00169809
         rho |  .99903266   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(44, 1381) = 22087.30                Prob > F = 0.0000

. predict u, u
(6,882 missing values generated)

. gen `1'within = `1'-u
(6,882 missing values generated)

. 
. lowess `1'within `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s
> 1manual) plotregion(ilwidth(medthin))

. 
. graph export "within_`1'_`2'.ps", as(ps) replace
(file within_Dist_to_World_Frontier_loggdp.ps written in PostScript format)

. 
. set more on

. 
end of do-file

. 
. *lowess Country_Risk loggdp if year==1980 &Country_Risk<.04, msize(tiny) sche
> me(s1mono)
. 
. 
. lowess Country_Risk loggdp if year==1980, msize(tiny) scheme(s1mono)

. 
. graph save "lowess_Country_Risk_loggdp",  replace
(file lowess_Country_Risk_loggdp.gph saved)

. 
. lowess Dist_to_World_Frontier loggdp , msize(tiny) scheme(s1mono)

. graph save "lowess_Dist_to_World_Frontier",  replace
(note: file lowess_Dist_to_World_Frontier.gph not found)
(file lowess_Dist_to_World_Frontier.gph saved)

. 
. log close
      name:  <unnamed>
       log:  /Users/koren/Tresorit/projects/published/voldev/replication/now we
> 're creating all the beautiful graphs.log
  log type:  text
 closed on:  12 Oct 2020, 08:43:01
-------------------------------------------------------------------------------

. 
end of do-file
