
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.0   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do createallgraphs.do 

. use "data/derived/specmeasures.dta", clear

. tsset, clear

. 
. drop if rgdpch==0
(0 observations deleted)

. 
. gen loggdp = log(rgdpch)
(3,924 missing values generated)

. 
. rename COV Sector_Country_Covariance

. rename SECT Sectoral_Risk

. rename HERF Herfindahl

. rename dnHERF Weighted_Herf

. rename TAU2 Country_Risk

. rename dnRISK Overall_risk

. rename BETA Sector_Country_Beta

. 
. label var loggdp "Log Real GDP per capita (PPP)"

. 
. label var Herfindahl "Herfindahl Index"

. label var Weighted_Herf "Weighted Herfindahl"

. label var Sectoral_Risk "Sectoral Risk"

. label var Country_Risk "Country Risk"

. label var Overall_risk "Overall Risk"

. label var Sector_Country_Beta "Sector-Country Beta"

. label var Sector_Country_Covariance "Sector-Country Covariance"

. 
. 
. foreach X of varlist  Herfindahl Weighted_Herf Sectoral_Risk Sector_Country_B
> eta {
  2.         do drawgraphs `X' loggdp
  3. }

. 
. capture drop u

. capture drop fitted

. capture drop `1'within

. 
. lowess `1' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manua
> l) plotregion(ilwidth(medthin))

. 
. 
. graph export "graphs/lowess_`1'_`2'.eps", replace
(file graphs/lowess_Herfindahl_loggdp.eps written in EPS format)

. 
. 
. 
. xtreg `1' `2', i(country) fe

Fixed-effects (within) regression               Number of obs     =        911
Group variable: country                         Number of groups  =         55

R-sq:                                           Obs per group:
     within  = 0.1011                                         min =          1
     between = 0.2142                                         avg =       16.6
     overall = 0.2462                                         max =         20

                                                F(1,855)          =      96.19
corr(u_i, Xb)  = -0.2416                        Prob > F          =     0.0000

------------------------------------------------------------------------------
  Herfindahl |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      loggdp |    .008497   .0008664     9.81   0.000     .0067965    .0101974
       _cons |  -.0186069    .007908    -2.35   0.019    -.0341283   -.0030856
-------------+----------------------------------------------------------------
     sigma_u |  .00885815
     sigma_e |  .00424631
         rho |  .81314492   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(54, 855) = 55.88                    Prob > F = 0.0000

. predict u, u
(7,329 missing values generated)

. gen `1'within = `1'-u
(7,329 missing values generated)

. 
. lowess `1'within `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s
> 1manual) plotregion(ilwidth(medthin))

. 
. graph export "graphs/within_`1'_`2'.eps", replace
(file graphs/within_Herfindahl_loggdp.eps written in EPS format)

. 
. 
end of do-file

. 
. capture drop u

. capture drop fitted

. capture drop `1'within

. 
. lowess `1' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manua
> l) plotregion(ilwidth(medthin))

. 
. 
. graph export "graphs/lowess_`1'_`2'.eps", replace
(file graphs/lowess_Weighted_Herf_loggdp.eps written in EPS format)

. 
. 
. 
. xtreg `1' `2', i(country) fe

Fixed-effects (within) regression               Number of obs     =        911
Group variable: country                         Number of groups  =         55

R-sq:                                           Obs per group:
     within  = 0.0016                                         min =          1
     between = 0.0315                                         avg =       16.6
     overall = 0.0442                                         max =         20

                                                F(1,855)          =       1.39
corr(u_i, Xb)  = -0.2707                        Prob > F          =     0.2389

------------------------------------------------------------------------------
Weighted_H~f |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      loggdp |   .0096116   .0081557     1.18   0.239    -.0063959    .0256192
       _cons |  -.0436348   .0744431    -0.59   0.558    -.1897474    .1024779
-------------+----------------------------------------------------------------
     sigma_u |  .14157892
     sigma_e |  .03997335
         rho |  .92616971   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(54, 855) = 195.22                   Prob > F = 0.0000

. predict u, u
(7,329 missing values generated)

. gen `1'within = `1'-u
(7,329 missing values generated)

. 
. lowess `1'within `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s
> 1manual) plotregion(ilwidth(medthin))

. 
. graph export "graphs/within_`1'_`2'.eps", replace
(file graphs/within_Weighted_Herf_loggdp.eps written in EPS format)

. 
. 
end of do-file

. 
. capture drop u

. capture drop fitted

. capture drop `1'within

. 
. lowess `1' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manua
> l) plotregion(ilwidth(medthin))

. 
. 
. graph export "graphs/lowess_`1'_`2'.eps", replace
(file graphs/lowess_Sectoral_Risk_loggdp.eps written in EPS format)

. 
. 
. 
. xtreg `1' `2', i(country) fe

Fixed-effects (within) regression               Number of obs     =        911
Group variable: country                         Number of groups  =         55

R-sq:                                           Obs per group:
     within  = 0.1122                                         min =          1
     between = 0.5677                                         avg =       16.6
     overall = 0.5525                                         max =         20

                                                F(1,855)          =     108.09
corr(u_i, Xb)  = 0.3561                         Prob > F          =     0.0000

------------------------------------------------------------------------------
Sectoral_R~k |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      loggdp |   .0018246   .0001755    10.40   0.000     .0014801     .002169
       _cons |  -.0102096   .0016019    -6.37   0.000    -.0133537   -.0070656
-------------+----------------------------------------------------------------
     sigma_u |  .00201579
     sigma_e |  .00086014
         rho |  .84596888   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(54, 855) = 69.95                    Prob > F = 0.0000

. predict u, u
(7,329 missing values generated)

. gen `1'within = `1'-u
(7,329 missing values generated)

. 
. lowess `1'within `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s
> 1manual) plotregion(ilwidth(medthin))

. 
. graph export "graphs/within_`1'_`2'.eps", replace
(file graphs/within_Sectoral_Risk_loggdp.eps written in EPS format)

. 
. 
end of do-file

. 
. capture drop u

. capture drop fitted

. capture drop `1'within

. 
. lowess `1' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manua
> l) plotregion(ilwidth(medthin))

. 
. 
. graph export "graphs/lowess_`1'_`2'.eps", replace
(file graphs/lowess_Sector_Country_Beta_loggdp.eps written in EPS format)

. 
. 
. 
. xtreg `1' `2', i(country) fe

Fixed-effects (within) regression               Number of obs     =        911
Group variable: country                         Number of groups  =         55

R-sq:                                           Obs per group:
     within  = 0.1062                                         min =          1
     between = 0.0528                                         avg =       16.6
     overall = 0.0529                                         max =         20

                                                F(1,855)          =     101.61
corr(u_i, Xb)  = 0.1145                         Prob > F          =     0.0000

------------------------------------------------------------------------------
Sector_Cou~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      loggdp |  -.0669912    .006646   -10.08   0.000    -.0800355   -.0539469
       _cons |   .2407792   .0606625     3.97   0.000     .1217144     .359844
-------------+----------------------------------------------------------------
     sigma_u |  .44673221
     sigma_e |  .03257362
         rho |  .99471147   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(54, 855) = 3204.88                  Prob > F = 0.0000

. predict u, u
(7,329 missing values generated)

. gen `1'within = `1'-u
(7,329 missing values generated)

. 
. lowess `1'within `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s
> 1manual) plotregion(ilwidth(medthin))

. 
. graph export "graphs/within_`1'_`2'.eps", replace
(file graphs/within_Sector_Country_Beta_loggdp.eps written in EPS format)

. 
. 
end of do-file

. 
. lowess Country_Risk loggdp if year==1990, msize(tiny) scheme(s1mono)

. graph export "graphs/lowess_Country_Risk_loggdp.eps",  replace
(file graphs/lowess_Country_Risk_loggdp.eps written in EPS format)

. 
. 
end of do-file
