
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.0   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do createallgraphs.do 

. use "data/derived/specmeasures.dta", clear

. tsset, clear

. 
. drop if rgdpch==0
(0 observations deleted)

. 
. gen loggdp = log(rgdpch)
(3,993 missing values generated)

. 
. rename COV Sector_Country_Covariance

. rename GSECT Sectoral_Risk

. rename HERF Herfindahl

. rename IDIO Idiosyncratic_Risk

. rename CNT Country_Risk

. rename RISK Overall_risk

. 
. label var loggdp "Log Real GDP per capita (PPP)"

. 
. label var Herfindahl "Herfindahl Index"

. label var Idiosyncratic_Risk "Idiosyncratic Risk"

. label var Sectoral_Risk "Sectoral Risk"

. label var Country_Risk "Country Risk"

. label var Overall_risk "Overall Risk"

. label var Sector_Country_Covariance "Sector-Country Covariance"

. 
. 
. foreach X of varlist  Herfindahl Idiosyncratic_Risk Sectoral_Risk Sector_Coun
> try_Covariance {
  2.         do drawgraphs `X' loggdp
  3. }

. tempvar y1 y2 u

. local lbl : variable label `1'

. 
. * if risk measure is strictly positive, take logs
. summarize `1'

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  Herfindahl |      1,507    .1241311    .0560934   .0788353   .5599452

. if (r(min) > 0) {
.         generate `y1' = ln(`1')
(6,802 missing values generated)
.         label variable `y1' "`lbl' (log)"
. }

. else {
.         generate `y1' = `1'
.         label variable `y1' "`lbl'"
. }

. clonevar `y2' = `y1'
(6,802 missing values generated)

. 
. lowess `y1' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manu
> al) plotregion(ilwidth(medthin))

. graph export "graphs/lowess_`1'_`2'.eps", replace
(file graphs/lowess_Herfindahl_loggdp.eps written in EPS format)

. 
. xtreg `y1' `2', i(country) fe

Fixed-effects (within) regression               Number of obs     =      1,427
Group variable: country                         Number of groups  =         45

R-sq:                                           Obs per group:
     within  = 0.0003                                         min =         20
     between = 0.5224                                         avg =       31.7
     overall = 0.3965                                         max =         37

                                                F(1,1381)         =       0.36
corr(u_i, Xb)  = -0.6953                        Prob > F          =     0.5483

------------------------------------------------------------------------------
    __000000 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      loggdp |    .007358   .0122536     0.60   0.548    -.0166797    .0313958
       _cons |  -2.208677   .1083659   -20.38   0.000    -2.421257   -1.996098
-------------+----------------------------------------------------------------
     sigma_u |   .3155699
     sigma_e |  .12783332
         rho |  .85903596   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(44, 1381) = 93.08                   Prob > F = 0.0000

. predict `u', u
(6,882 missing values generated)

. replace `y2' = `y1' - `u'
(1,507 real changes made, 80 to missing)

. 
. lowess `y2' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manu
> al) plotregion(ilwidth(medthin))

. graph export "graphs/within_`1'_`2'.eps", replace
(file graphs/within_Herfindahl_loggdp.eps written in EPS format)

. 
. 
end of do-file

. tempvar y1 y2 u

. local lbl : variable label `1'

. 
. * if risk measure is strictly positive, take logs
. summarize `1'

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
Idiosyncra~k |      1,507    .0054294    .0062876   .0003165   .0328147

. if (r(min) > 0) {
.         generate `y1' = ln(`1')
(6,802 missing values generated)
.         label variable `y1' "`lbl' (log)"
. }

. else {
.         generate `y1' = `1'
.         label variable `y1' "`lbl'"
. }

. clonevar `y2' = `y1'
(6,802 missing values generated)

. 
. lowess `y1' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manu
> al) plotregion(ilwidth(medthin))

. graph export "graphs/lowess_`1'_`2'.eps", replace
(file graphs/lowess_Idiosyncratic_Risk_loggdp.eps written in EPS format)

. 
. xtreg `y1' `2', i(country) fe

Fixed-effects (within) regression               Number of obs     =      1,427
Group variable: country                         Number of groups  =         45

R-sq:                                           Obs per group:
     within  = 0.0245                                         min =         20
     between = 0.6884                                         avg =       31.7
     overall = 0.6009                                         max =         37

                                                F(1,1381)         =      34.65
corr(u_i, Xb)  = -0.8006                        Prob > F          =     0.0000

------------------------------------------------------------------------------
    __000000 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      loggdp |   .0757578   .0128698     5.89   0.000     .0505114    .1010042
       _cons |  -6.539546   .1138148   -57.46   0.000    -6.762815   -6.316278
-------------+----------------------------------------------------------------
     sigma_u |   1.290303
     sigma_e |  .13426105
         rho |  .98928876   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(44, 1381) = 997.68                  Prob > F = 0.0000

. predict `u', u
(6,882 missing values generated)

. replace `y2' = `y1' - `u'
(1,507 real changes made, 80 to missing)

. 
. lowess `y2' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manu
> al) plotregion(ilwidth(medthin))

. graph export "graphs/within_`1'_`2'.eps", replace
(file graphs/within_Idiosyncratic_Risk_loggdp.eps written in EPS format)

. 
. 
end of do-file

. tempvar y1 y2 u

. local lbl : variable label `1'

. 
. * if risk measure is strictly positive, take logs
. summarize `1'

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
Sectoral_R~k |      1,507    .0037045    .0004958   .0026052   .0062056

. if (r(min) > 0) {
.         generate `y1' = ln(`1')
(6,802 missing values generated)
.         label variable `y1' "`lbl' (log)"
. }

. else {
.         generate `y1' = `1'
.         label variable `y1' "`lbl'"
. }

. clonevar `y2' = `y1'
(6,802 missing values generated)

. 
. lowess `y1' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manu
> al) plotregion(ilwidth(medthin))

. graph export "graphs/lowess_`1'_`2'.eps", replace
(file graphs/lowess_Sectoral_Risk_loggdp.eps written in EPS format)

. 
. xtreg `y1' `2', i(country) fe

Fixed-effects (within) regression               Number of obs     =      1,427
Group variable: country                         Number of groups  =         45

R-sq:                                           Obs per group:
     within  = 0.5114                                         min =         20
     between = 0.5927                                         avg =       31.7
     overall = 0.5607                                         max =         37

                                                F(1,1381)         =    1445.40
corr(u_i, Xb)  = -0.3117                        Prob > F          =     0.0000

------------------------------------------------------------------------------
    __000000 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      loggdp |  -.1364966   .0035903   -38.02   0.000    -.1435396   -.1294536
       _cons |  -4.396109   .0317508  -138.46   0.000    -4.458394   -4.333824
-------------+----------------------------------------------------------------
     sigma_u |  .08114316
     sigma_e |  .03745473
         rho |  .82435899   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(44, 1381) = 134.63                  Prob > F = 0.0000

. predict `u', u
(6,882 missing values generated)

. replace `y2' = `y1' - `u'
(1,507 real changes made, 80 to missing)

. 
. lowess `y2' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manu
> al) plotregion(ilwidth(medthin))

. graph export "graphs/within_`1'_`2'.eps", replace
(file graphs/within_Sectoral_Risk_loggdp.eps written in EPS format)

. 
. 
end of do-file

. tempvar y1 y2 u

. local lbl : variable label `1'

. 
. * if risk measure is strictly positive, take logs
. summarize `1'

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
Sector_Cou~e |      1,507   -.0000518    .0081577  -.0206801   .0443218

. if (r(min) > 0) {
.         generate `y1' = ln(`1')
.         label variable `y1' "`lbl' (log)"
. }

. else {
.         generate `y1' = `1'
(6,802 missing values generated)
.         label variable `y1' "`lbl'"
. }

. clonevar `y2' = `y1'
(6,802 missing values generated)

. 
. lowess `y1' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manu
> al) plotregion(ilwidth(medthin))

. graph export "graphs/lowess_`1'_`2'.eps", replace
(note: file graphs/lowess_Sector_Country_Covariance_loggdp.eps not found)
(file graphs/lowess_Sector_Country_Covariance_loggdp.eps written in EPS format)

. 
. xtreg `y1' `2', i(country) fe

Fixed-effects (within) regression               Number of obs     =      1,427
Group variable: country                         Number of groups  =         45

R-sq:                                           Obs per group:
     within  = 0.0019                                         min =         20
     between = 0.0083                                         avg =       31.7
     overall = 0.0002                                         max =         37

                                                F(1,1381)         =       2.57
corr(u_i, Xb)  = -0.0275                        Prob > F          =     0.1093

------------------------------------------------------------------------------
    __000000 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      loggdp |    .000127   .0000792     1.60   0.109    -.0000285    .0002824
       _cons |  -.0012659   .0007008    -1.81   0.071    -.0026407    .0001089
-------------+----------------------------------------------------------------
     sigma_u |  .00939441
     sigma_e |   .0008267
         rho |  .99231559   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(44, 1381) = 3220.66                 Prob > F = 0.0000

. predict `u', u
(6,882 missing values generated)

. replace `y2' = `y1' - `u'
(1,507 real changes made, 80 to missing)

. 
. lowess `y2' `2', bwidth(0.5) adjust msymbol(circle) msize(tiny) scheme(s1manu
> al) plotregion(ilwidth(medthin))

. graph export "graphs/within_`1'_`2'.eps", replace
(note: file graphs/within_Sector_Country_Covariance_loggdp.eps not found)
(file graphs/within_Sector_Country_Covariance_loggdp.eps written in EPS format)

. 
. 
end of do-file

. 
. lowess Country_Risk loggdp if year==1980, msize(tiny) scheme(s1mono)

. graph export "graphs/lowess_Country_Risk_loggdp.eps",  replace
(file graphs/lowess_Country_Risk_loggdp.eps written in EPS format)

. 
end of do-file
