
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.0   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do wdisectors.do 

. *******ILO data
. clear

. set mem 500m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are
    performed on the fly automatically.

. ***data is ccode variable (many) V_year1 ---V_yearT
. insheet using "shares_ilo1.csv"
(26 vars, 696 obs)

. reshape long v_, i(ccode indcode) string
(note: j = 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 199
> 3 1994 1995 1996 1997 1998 1999 2000)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                      696   ->   14616
Number of variables                  26   ->       7
j variable (21 values)                    ->   _j
xij variables:
               v_1980 v_1981 ... v_2000   ->   v_
-----------------------------------------------------------------------------

. ren _j year

. rename v_ share

. drop if indcode==0| indcode==11| indcode>=20
(2,436 observations deleted)

. gen sector=.
(12,180 missing values generated)

. replace sector=100 if indcode ==1
(1,365 real changes made)

. replace sector=300 if indcode==2|indcode==3|indcode==4|indcode==5
(5,376 real changes made)

. replace sector=500 if indcode>=6&indcode<=10
(5,439 real changes made)

. collapse (sum)share, by (ccode year sector)

. egen totempl = sum(share), by(ccode year)

. replace share = share/totemp*100
(4,095 real changes made, 1,413 to missing)

. egen sumshare = sum(share), by(ccode year)

. drop if sumshare==0 
(1,413 observations deleted)

. drop sumshare

. sort ccode year sector

. 
. tempfile shares

. save `shares', replace
(note: file /var/folders/f4/7drmhl1d5kj3wp1r33jvx32m0000gn/T//St01303.000001 no
> t found)
file /var/folders/f4/7drmhl1d5kj3wp1r33jvx32m0000gn/T//St01303.000001 saved

. 
. 
. ******WDI data
. ***data is ccode variable (many) V_year1 ---V_yearT
. insheet using "sectoraldata.csv", clear
(47 vars, 3,744 obs)

. reshape long v_, i(ccode variable) string
(note: j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 197
> 3 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 
> 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     3744   ->  164736
Number of variables                  47   ->       5
j variable (44 values)                    ->   _j
xij variables:
               v_1960 v_1961 ... v_2003   ->   v_
-----------------------------------------------------------------------------

. ren _j year

. reshape wide v_, i(ccode  year) j( variable) string
(note: j = ag2000 aggrowth agpw2000 agshare emind empag empser gdp2000 gdppc200
> 0 ind2000 indgrowth indshare laborforce man2000 mangrowth manshare ser2000 se
> rgrowth sershare unemp)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   164736   ->    9636
Number of variables                   5   ->      23
j variable (20 values)         variable   ->   (dropped)
xij variables:
                                     v_   ->   v_ag2000 v_aggrowth ... v_unemp
-----------------------------------------------------------------------------

. renpfix v_ 

. replace agshare=ag2000/gdp2000*100  if agshare==. & ag2000~=.
(250 real changes made)

. replace indshare=ag2000/gdp2000*100 if indshare==. & ind2000~=.
(234 real changes made)

. replace sershare=ag2000/gdp2000*100 if sershare==. & ser2000~=.
(220 real changes made)

. keep ccode year agshare indshare sershare emind empag empser unemp gdp2000 gd
> ppc2000 laborforce

. ren agshare yshare100

. ren indshare yshare300

. ren sershare yshare500

. ren empag empshare100

. ren emind empshare300

. ren empser empshare500

. reshape long yshare empshare, i(ccode year) j(sector) 
(note: j = 100 300 500)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     9636   ->   28908
Number of variables                  12   ->       9
j variable (3 values)                     ->   sector
xij variables:
          yshare100 yshare300 yshare500   ->   yshare
    empshare100 empshare300 empshare500   ->   empshare
-----------------------------------------------------------------------------

. sort ccode year sector

. 
. merge ccode year sector using `shares'
(note: you are using old merge syntax; see [D] merge for new syntax)
(note: variable sector was int, now float to accommodate using data's values)

. tab _

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     26,238       90.73       90.73
          2 |         12        0.04       90.77
          3 |      2,670        9.23      100.00
------------+-----------------------------------
      Total |     28,920      100.00

. drop _

. destring, replace
ccode: contains nonnumeric characters; no replace
year: all characters numeric; replaced as int
sector already numeric; no replace
empshare already numeric; no replace
gdp2000 already numeric; no replace
gdppc2000 already numeric; no replace
laborforce already numeric; no replace
yshare already numeric; no replace
unemp already numeric; no replace
share already numeric; no replace
totempl already numeric; no replace

. replace empshare=share if ccode=="PRT"&(year<1994|year>=1980)
(66 real changes made, 24 to missing)

. replace empshare=share if ccode=="PRI"&(year>=1999)
(9 real changes made, 3 to missing)

. replace empshare=share if ccode=="KOR"&(year<=1994)
(45 real changes made)

. replace empshare=share if ccode=="MAR"&(year==2000)
(3 real changes made)

. replace empshare=share if ccode=="MAC"&(year<=1988)
(3 real changes made)

. replace empshare=share if ccode=="GER"|ccode=="TTO"
(75 real changes made)

. egen sumempshare = sum(empshare), by(ccode year)

. 
. drop if sumemp==0
(23,151 observations deleted)

. replace empshare=empshare/sumempshare*100
(3,940 real changes made)

. 
. save "wdiilo.dta", replace
file wdiilo.dta saved

. 
. 
. 
end of do-file
